Repository: JulienDelRio/wp-cpt-rest-api
Catalog: src/languages/wp-cpt-rest-api-*.po
Languages: fr_fr

source: Please enter a label for the API key.
fr_fr: Veuillez saisir un libellé pour la clé API.

source: Generating...
fr_fr: Génération...

source: Generate API Key
fr_fr: Générer une clé API

source: Copy
fr_fr: Copier

source: Copied!
fr_fr: Copié !

source: Failed to copy. Please try again.
fr_fr: Échec de la copie. Veuillez réessayer.

source: An error occurred. Please try again.
fr_fr: Une erreur s'est produite. Veuillez réessayer.

source: Are you sure you want to deactivate all Custom Post Types? This action will uncheck all toggle switches.
fr_fr: Êtes-vous sûr de vouloir désactiver tous les types de publication personnalisés ? Cette action décochera tous les interrupteurs.

source: Resetting...
fr_fr: Réinitialisation...

source: Reset All
fr_fr: Tout réinitialiser

source: REST API Settings
fr_fr: Paramètres de l'API REST

source: API Base Segment
fr_fr: Segment de base de l'API

source: Enable Toolset relationship support
fr_fr: Activer le support des relations Toolset

source: Include non-public Custom Post Types
fr_fr: Inclure les types de contenu personnalisés non publics

source: Custom Post Types
fr_fr: Types de contenu personnalisés

source: Active Post Types
fr_fr: Types de contenu actifs

source: API Keys
fr_fr: Clés API

source: Manage API Keys
fr_fr: Gérer les clés API

source: Configure the base segment for the Custom Post Types REST API.
fr_fr: Configurez le segment de base pour l'API REST des types de contenu personnalisés.

source: Must be between 1 and 120 characters long and can only contain lowercase letters, digits, and hyphens.
fr_fr: Doit contenir entre 1 et 120 caractères et ne peut contenir que des lettres minuscules, des chiffres et des tirets.

source: The base segment defines the namespace for your REST API endpoints. It must be between 1 and 120 characters long and can only contain lowercase letters (a-z), digits (0-9), and hyphens (-).
fr_fr: Le segment de base définit l'espace de noms pour vos points de terminaison de l'API REST. Il doit contenir entre 1 et 120 caractères et ne peut contenir que des lettres minuscules (a-z), des chiffres (0-9) et des tirets (-).

source: Full REST API URL:
fr_fr: URL complète de l'API REST :

source: Enable
fr_fr: Activer

source: When enabled, this will add REST API endpoints for managing Toolset relationships between Custom Post Types. Requires Toolset Types plugin to be installed and active.
fr_fr: Lorsqu'activé, cela ajoutera des points de terminaison API REST pour gérer les relations Toolset entre les types de publication personnalisés. Nécessite que le plugin Toolset Types soit installé et actif.

source: Enable this option to include Toolset relationship functionality in the REST API endpoints.
fr_fr: Activer la prise en charge de la fonctionnalité de relations Toolset dans l'API REST.

source: The base segment can only contain lowercase letters, digits, and hyphens.
fr_fr: Doit contenir entre 1 et 120 caractères et ne peut contenir que des lettres minuscules, des chiffres et des tirets.

source: Settings saved successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Custom Post Types settings saved successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Toolset relationship settings saved successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Non-public CPT visibility settings saved successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Publicly Queryable
fr_fr: Interrogeable publiquement

source: Admin Only (Show UI)
fr_fr: Administration uniquement (Afficher l'interface)

source: Private
fr_fr: Privé

source: Select which types of non-public Custom Post Types should be available for selection:
fr_fr: Sélectionnez les types de publications personnalisées non publiques qui doivent être disponibles pour sélection :

source: Public CPTs are always available. Select additional visibility types to include in the list below.
fr_fr: Remarque : Les CPT publics sont toujours disponibles. Sélectionnez des types de visibilité supplémentaires à inclure dans la liste ci-dessous.

source: Choose which types of non-public CPTs to make available for API exposure. Publicly Queryable CPTs can be queried but aren't fully public. Admin Only CPTs show in WordPress admin. Private CPTs are completely hidden from public access.
fr_fr: Choisissez les types de CPT non publics à rendre disponibles pour l'exposition API. Les CPT interrogeables publiquement peuvent être interrogés mais ne sont pas entièrement publics. Les CPT d'administration uniquement s'affichent dans l'administration WordPress. Les CPT privés sont complètement cachés de l'accès public.

source: Select which Custom Post Types should be available through the REST API. Use the option above to include non-public CPTs in the selection.
fr_fr: Sélectionnez les types de publication personnalisés qui doivent être disponibles via l'API REST.

source: Post Type
fr_fr: Type de publication

source: Slug
fr_fr: Identifiant

source: Visibility
fr_fr: Visibilité

source: Status
fr_fr: Statut

source: No description available
fr_fr: Aucune description disponible

source: Admin Only
fr_fr: Administration uniquement (Afficher l'interface)

source: Activate
fr_fr: Activer

source: Reset All will deactivate all Custom Post Types.
fr_fr: Tout réinitialiser désactivera tous les types de publication personnalisés.

source: CPT REST API
fr_fr: API REST des types de contenu personnalisés

source: API Settings
fr_fr: Paramètres de l'API

source: REST API Base Segment
fr_fr: Segment de base de l'API

source: Toolset Relationships
fr_fr: Relations Toolset

source: Enable support for Toolset relationship functionality in the REST API.
fr_fr: Activer la prise en charge de la fonctionnalité de relations Toolset dans l'API REST.

source: Non-Public Custom Post Types
fr_fr: Types de publication personnalisés non publics

source: Control whether non-public Custom Post Types should be available for selection.
fr_fr: Contrôler si les types de publication personnalisés non publics doivent être disponibles pour sélection.

source: Select which Custom Post Types should be available through the REST API.
fr_fr: Sélectionnez les types de publication personnalisés qui doivent être disponibles via l'API REST.

source: Save Settings
fr_fr: Enregistrer les paramètres

source: API Keys Management
fr_fr: Gestion des clés API

source: Create and manage API keys for accessing the REST API endpoints.
fr_fr: Créer et gérer les clés API pour accéder aux points de terminaison de l'API REST.

source: API keys can be used to authenticate requests to the REST API using the Bearer authentication method.
fr_fr: Les clés API peuvent être utilisées pour authentifier les requêtes vers l'API REST en utilisant la méthode d'authentification Bearer.

source: Security Notice:
fr_fr: Avis de sécurité :

source: API keys grant full access to all enabled Custom Post Types
fr_fr: Les clés API sont nécessaires pour authentifier les requêtes de l'API REST. Chaque clé fournit un accès complet à tous les types de contenu personnalisés activés.

source: Your API Keys
fr_fr: Vos clés API

source: Label
fr_fr: Libellé

source: Key Prefix
fr_fr: Préfixe de clé

source: Created
fr_fr: Créée

source: Full key hidden for security
fr_fr: Clé complète masquée pour la sécurité

source: Are you sure you want to delete this API key? This action cannot be undone.
fr_fr: Êtes-vous sûr de vouloir supprimer cette clé API ? Cette action ne peut pas être annulée.

source: Delete
fr_fr: Supprimer

source: Create a New API Key
fr_fr: Créer une nouvelle clé API

source: Enter a label for your API key
fr_fr: Entrez un libellé pour votre clé API

source: A descriptive name to help you identify this key.
fr_fr: Un nom descriptif pour vous aider à identifier cette clé.

source: Important: Save Your API Key Now
fr_fr: Important : Enregistrez votre clé API maintenant

source: This key will only be displayed once and cannot be recovered.
fr_fr: Cette clé ne sera affichée qu'une seule fois et ne peut pas être récupérée.

source: Copy it now and store it securely. If you lose this key, you will need to generate a new one.
fr_fr: Copiez-la maintenant et stockez-la en toute sécurité. Si vous perdez cette clé, vous devrez en générer une nouvelle.

source: Copy Key
fr_fr: Copier la clé

source: You do not have permission to perform this action.
fr_fr: Permissions insuffisantes pour effectuer cette action.

source: Rate limit exceeded. Please wait before generating more keys.
fr_fr: Limite de débit dépassée. Veuillez attendre avant de générer plus de clés.

source: Label is required.
fr_fr: Le titre est obligatoire.

source: API key created successfully.
fr_fr: Clé API générée avec succès.

source: Failed to create API key.
fr_fr: Échec de la création de l'article.

source: Key ID is required.
fr_fr: L'ID de la clé API est obligatoire.

source: API key deleted successfully.
fr_fr: Clé API générée avec succès.

source: Failed to delete API key.
fr_fr: Échec de la suppression de l'article.

source: All Custom Post Types have been deactivated.
fr_fr: Les types de contenu personnalisés actifs ont été mis à jour.

source: Failed to reset Custom Post Types.
fr_fr: Sélectionner les types de contenu personnalisés

source: CPT REST API:
fr_fr: URL complète de l'API REST :

source: No Custom Post Types are currently enabled for the REST API. %s to get started.
fr_fr: Aucun type de contenu personnalisé n'est actuellement activé pour l'accès à l'API REST.

source: Configure settings
fr_fr: Configurer les clés API

source: No API keys have been created yet. You need at least one API key to access the REST API endpoints. %s
fr_fr: Créer et gérer les clés API pour accéder aux points de terminaison de l'API REST.

source: Create an API key
fr_fr: Créer une nouvelle clé API

source: Insufficient permissions.
fr_fr: Permissions insuffisantes pour effectuer cette action.

source: Critical Security Update Required
fr_fr: Mise à jour de sécurité critique requise

source: Your API keys are stored insecurely and must be migrated to secure hashed storage.
fr_fr: Les clés API ont été migrées avec succès vers un stockage haché sécurisé.

source: Existing Keys to be Removed:
fr_fr: Clés existantes à migrer

source: You must regenerate new secure keys after migration
fr_fr: Vous ne pourrez plus voir les clés complètes après la migration

source: New keys will only be visible once upon creation (store them securely)
fr_fr: Cette clé ne sera affichée qu'une seule fois et ne peut pas être récupérée.

source: Migrate to Secure Keys Now
fr_fr: Migrer vers le stockage sécurisé

source: Critical Security Update Required - CPT REST API
fr_fr: Mise à jour de sécurité critique requise

source: This Custom Post Type is not enabled for API access.
fr_fr: Ce type de contenu personnalisé n'est pas activé dans l'API REST.

source: Invalid post ID provided.
fr_fr: Type de contenu personnalisé invalide.

source: Failed to create post. Please check your input and try again.
fr_fr: Échec de la copie. Veuillez réessayer.

source: Failed to update post. Please check your input and try again.
fr_fr: Échec de la copie. Veuillez réessayer.

source: Failed to delete post. Please try again.
fr_fr: Échec de la copie. Veuillez réessayer.

source: Toolset plugin is not active or Toolset support is not enabled.
fr_fr: L'extension Toolset n'est pas active ou l'API des relations n'est pas disponible.

source: Toolset operation failed.
fr_fr: Relations Toolset

source: Relationship not found or invalid relationship ID.
fr_fr: Relation introuvable.

source: Invalid relationship ID format.
fr_fr: Activer le support des relations Toolset

source: WordPress Custom Post Types REST API
fr_fr: API REST des types de contenu personnalisés

source: Relationship created successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Failed to create relationship.
fr_fr: Échec de la création de la relation.

source: Relationship deleted successfully.
fr_fr: Paramètres enregistrés avec succès.
